Revit 2016 API
Rectangle.Right Property
 The x-coordinate of the bottom-right corner of the rectangle.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public int Right { get; set; }
Visual Basic
Public Property Right As Integer
	Get
	Set
Visual C++
public:
property int Right {
	int get ();
	void set (int value);
}
See Also
Rectangle Class
Autodesk.Revit.UI Namespace